WanDejun/STM32F103C8T6/示波器/Hardware/OLED.c
#include "stm32f10x.h"
#include "OLED.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

// #define SPI_SPEED_36000000
// #define SPI_SPEED_18000000
// #define SPI_SPEED_9000000
// #define SPI_SPEED_4500000
// #define SPI_SPEED_2250000
 #define SPI_SPEED_1125000
// #define SPI_SPEED_562500
// #define SPI_SPEED_281250

/**
  * 数据存储格式：
  * 纵向8点，高位在下，先从左到右，再从上到下
  * 每一个Bit对应一个像素点
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * 坐标轴定义：
  * 左上角为(0, 0)点
  * 横向向右为X轴，取值范围：0~127
  * 纵向向下为Y轴，取值范围：0~63
  * 
  *       0             X轴           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y轴 |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*全局变量*********************/

/**
  * OLED显存数组
  * 所有的显示函数，都只是对此显存数组进行读写
  * 随后调用OLED_Update函数或OLED_UpdateArea函数
  * 才会将显存数组的数据发送到OLED硬件，进行显示
  */
uint8_t OLED_DisplayBuf[8][128];
uint8_t DMA1_Channal3_StateFlag;

void delay() {
	__IO uint8_t i;
	__IO uint8_t n;
#ifdef SPI_SPEED_36000000
		return;
#endif
#ifdef SPI_SPEED_18000000
		n = 2;
#endif		
#ifdef SPI_SPEED_9000000
		n = 5;
#endif
#ifdef SPI_SPEED_4500000
		n = 10;
#endif
#ifdef SPI_SPEED_2250000
		n = 20;
#endif
#ifdef SPI_SPEED_1125000
		n = 40;
#endif
#ifdef SPI_SPEED_562500
		n = 80;
#endif
#ifdef SPI_SPEED_281250
		n = 160;
#endif
	for (i = 0; i < n; i++) {
		i++;
		i--;
	}
}

/*********************全局变量*/

#define CS_Pin 		GPIO_Pin_4
#define DC_Pin 		GPIO_Pin_6
#define CLK_Pin 	GPIO_Pin_5
#define MOSI_Pin 	GPIO_Pin_7

/*引脚配置*********************/
/**
  * 函    数：OLED写DC高低电平
  * 参    数：要写入DC的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写DC时，此函数会被调用
  *           用户需要根据参数传入的值，将DC置为高电平或者低电平
  *           当参数传入0时，置DC为低电平，当参数传入1时，置DC为高电平
  */
void OLED_W_DC(uint8_t BitValue) {
	/*根据BitValue的值，将DC置高电平或者低电平*/
	GPIO_WriteBit(GPIOA, DC_Pin, (BitAction)BitValue);
}

/**
  * 函    数：OLED写CS高低电平
  * 参    数：要写入CS的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写CS时，此函数会被调用
  *           用户需要根据参数传入的值，将CS置为高电平或者低电平
  *           当参数传入0时，置CS为低电平，当参数传入1时，置CS为高电平
  */
void OLED_W_CS(uint8_t BitValue) {
	/*根据BitValue的值，将CS置高电平或者低电平*/
	GPIO_WriteBit(GPIOA, CS_Pin, (BitAction)BitValue);
}

/**
  * 函    数：OLED引脚初始化
  * 参    数：无
  * 返 回 值：无
  * 说    明：当上层函数需要初始化时，此函数会被调用
  *           用户需要将D0、D1、RES、DC和CS引脚初始化为推挽输出模式
  */
void OLED_GPIO_Init(void) {
	uint32_t i, j;
	
	/*在初始化前，加入适量延时，待OLED供电稳定*/
	for (i = 0; i < 1000; i ++) {
		for (j = 0; j < 1000; j ++);
	}
	
	/*将D0、D1、RES、DC和CS引脚初始化为推挽输出模式*/
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = DC_Pin;
 	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = CS_Pin;
 	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = CLK_Pin;
 	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = MOSI_Pin;
 	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	SPI_InitTypeDef SPI_InitSturcture;
	
#ifdef SPI_SPEED_36000000
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
#endif
#ifdef SPI_SPEED_18000000
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
#endif
#ifdef SPI_SPEED_9000000
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_8;
#endif
#ifdef SPI_SPEED_4500000
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
#endif
#ifdef SPI_SPEED_2250000
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32;
#endif
#ifdef SPI_SPEED_1125000
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_64;
#endif
#ifdef SPI_SPEED_562500
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_128;
#endif
#ifdef SPI_SPEED_281250
	SPI_InitSturcture.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;
#endif

	SPI_InitSturcture.SPI_CPHA = SPI_CPHA_1Edge;
	SPI_InitSturcture.SPI_CPOL = SPI_CPOL_Low;
	SPI_InitSturcture.SPI_CRCPolynomial = 7;
	SPI_InitSturcture.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitSturcture.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitSturcture.SPI_FirstBit = SPI_FirstBit_MSB; //高位先行
	SPI_InitSturcture.SPI_Mode = SPI_Mode_Master;
	SPI_InitSturcture.SPI_NSS = SPI_NSS_Soft;
	SPI_Init(SPI1, &SPI_InitSturcture);
	
	SPI_Cmd(SPI1, ENABLE);
	SPI_I2S_DMACmd(SPI1, SPI_I2S_DMAReq_Tx, ENABLE);
	
	/*置引脚默认电平*/
	OLED_W_DC(1);
	OLED_W_CS(1);
}

void OLED_DMA_Init(void) {
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
	
	DMA_InitTypeDef DMA_InitStructure;
	DMA_InitStructure.DMA_BufferSize = 0; //DMA菜单中的任务数量
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)(OLED_DisplayBuf[0]);
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&SPI1->DR;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_Init(DMA1_Channel3, &DMA_InitStructure);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_Init(&NVIC_InitStructure);
	
